Revit 2027 API
SpatialElementBoundaryOptions.SpatialElementBoundaryLocation Property
 The boundary of spatial element for geometry calculation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SpatialElementBoundaryLocation SpatialElementBoundaryLocation { get; set; }
Public Property SpatialElementBoundaryLocation As SpatialElementBoundaryLocation
	Get
	Set
public:
property SpatialElementBoundaryLocation SpatialElementBoundaryLocation {
	SpatialElementBoundaryLocation get ();
	void set (SpatialElementBoundaryLocation value);
}
member SpatialElementBoundaryLocation : SpatialElementBoundaryLocation with get, set
Property Value
SpatialElementBoundaryLocation
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
SpatialElementBoundaryOptions Class
Autodesk.Revit.DB Namespace